In [3]:
import pandas as pd

In [5]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

In [20]:
df = pd.read_csv(url,sep = '|' , index_col='user_id')

In [21]:

df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [2]:
# Step 3. Assign it to a variable called users and use the 'user_id' as index

In [ ]:
# Step 4. See the first 25 entries

In [24]:
df.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [ ]:
# Step 5. See the last 10 entries

In [25]:
df.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [ ]:
# Step 6. What is the number of observations in the dataset?

In [31]:
df.shape[0]

943

In [ ]:
# Step 7. What is the number of columns in the dataset?

In [32]:
df.shape[1]

4

In [ ]:
# Step 8. Print the name of all the columns.

In [33]:
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [ ]:
# Step 9. How is the dataset indexed?

In [34]:
df.index.dtype

dtype('int64')

In [ ]:
# Step 10. What is the data type of each column?

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [ ]:
# Step 11. Print only the occupation column

In [40]:
df[['occupation']]

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

In [ ]:
# Step 12. How many different occupations are in this dataset?

In [42]:
df['occupation'].value_counts().count()

21

In [ ]:
# Step 13. What is the most frequent occupation?

In [61]:
df['occupation'].value_counts().sort_values(ascending=False).head(1)

student    196
Name: occupation, dtype: int64

In [ ]:
# Step 14. Summarize the DataFrame.

In [64]:
df.describe().T

     count       mean       std  min   25%   50%   75%   max
age  943.0  34.051962  12.19274  7.0  25.0  31.0  43.0  73.0

In [ ]:
# Step 15. Summarize all the columns

In [66]:
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
age,943,NaN,NaN,NaN,34.052,12.1927,7,25,31,43,73
gender,943,2,M,670,NaN,NaN,NaN,NaN,NaN,NaN,NaN
occupation,943,21,student,196,NaN,NaN,NaN,NaN,NaN,NaN,NaN
zip_code,943,795,55414,9,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
# Step 16. Summarize only the occupation column

In [67]:
df.occupation.describe().T

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [ ]:
# Step 17. What is the mean age of users?

In [70]:
round(df.age.mean()) #round yuvarlar

34

In [ ]:
# Step 18. What is the age with least occurrence?

In [71]:
df.age.value_counts().tail()

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64